// 주석(comment)
// 주석은 프로그램 실행에 영향을 미치지 않는 문장
// 주석은 문장 앞에 // 를 붙여서 표현

// C언어는 함수의 나열이다. 
// f(x) = 2x + 3
// 함수는 함수의 내용을 작성하고
// 함수로 처리할 값을 전달함
// 인수(argumnet) : 함수로 전달되는 실제 값 : f(3) -> 3
// 매개변수(parameter) : 함수로 전달하는데 사용하는 데이터 : x
// 함수를 통해 나온 결과값 : 반환값(return)

// C언어에는 반드시 있어야 하는 함수가 존재 : main()
// main() 함수는 C코드의 진입점
// 코드를 실행(ctrl + F5) 할 때 가장 먼저 호출

// 함수의 종류
// 사용자함수 : 사용자가 필요에 의해서 작성하는 함수
// 라이브러리 : C언어가 미리 준비한 함수

korea()
{
	
}

japan()
{

}

china()
{

}

main()   //꼭필요한 함수
{

}